app/controllers/blocks_controller.rb

  def create
    user = User.find(params[:id])
    @current_user.blockeds << user
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "blocks" ("blocker_id", "blocked_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["blocker_id", 3], ["blocked_id", 2], ["created_at", "2023-09-04 11:37:55.001382"], ["updated_at", "2023-09-04 11:37:55.001382"]]

  def destroy
    block = @current_user.blockeds.find_by(id: params[:id])
    if block
      block.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]