app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
  def set_comment
    @comment = Comment.find_by(id: params[:id])