app/controllers/comments_controller.rb

  def index
    @post = @user.posts.find(params[:post_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT ?  [["user_id", 1], ["id", 6], ["LIMIT", 1]]

  def update
    if @comment.update(comment_params)
---
UPDATE "comments" SET "content" = ?, "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "Not that Nice"], ["user_id", 1], ["updated_at", "2023-08-31 09:30:52.327355"], ["id", 10]]

  def create
    @comments = Comment.new(comment_params)
    if @comments.save
---
INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "New Comment"], ["user_id", 1], ["post_id", 5], ["created_at", "2023-08-25 10:45:00.267385"], ["updated_at", "2023-08-25 10:45:00.267385"]]

  def destroy
    post = @comment.post
    @comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 9]]