app/controllers/follows_controller.rb

SELECT "follows".* FROM "follows"
---
  def index
    follows = Follow.all

INSERT INTO "follows" ("follower_id", "followee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 1], ["followee_id", 3], ["created_at", "2023-09-04 09:53:45.642989"], ["updated_at", "2023-09-04 09:53:45.642989"]]
---
  def create
    follow = Follow.new(follow_params)
    if follow.save

SELECT "follows".* FROM "follows" WHERE "follows"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def show
    follow = Follow.find_by(id: params[:id])

SELECT "follows".* FROM "follows" WHERE "follows"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "follows" WHERE "follows"."id" = ?  [["id", 1]]
---
  def destroy
    follow = @current_user.follows.find_by(id: params[:id])
    if follow
      follow.destroy