app/controllers/posts_controller.rb

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 8]]
---
  def destroy
    if @post && @post.user == @current_user
      @post.destroy