app/controllers/posts_controller.rb

  def create
    posts = @current_user.posts.new(post_params)
    if posts.save
---
INSERT INTO "posts" ("content", "image", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Hello this is 2nd post"], ["image", "second.jpeg"], ["user_id", 1], ["created_at", "2023-08-23 07:41:52.207344"], ["updated_at", "2023-08-23 07:41:52.207344"]]

  def update
    posts = @current_user.posts.find(params[:id])
    if posts.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT ?  [["user_id", 2], ["id", 11], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "image" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "Third Post"], ["image", "Third.jpeg"], ["updated_at", "2023-08-23 10:14:20.783296"], ["id", 5]]

  def destroy
    posts = @current_user.posts.find(params[:id])
    posts.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT ?  [["user_id", 2], ["id", 11], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 11]]

  def show
    posts = @current_user.posts.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT ?  [["user_id", 2], ["id", 9], ["LIMIT", 1]]