app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("email", "password_digest", "fname", "lname", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    if @current_user.update(user_params)
---
UPDATE "users" SET "fname" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["fname", "Ashu"], ["updated_at", "2023-09-03 21:22:37.231312"], ["id", 3]]

  def follow
    user = User.find(params[:id])
    current_user.followees << user
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "follows" ("follower_id", "followee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 3], ["followee_id", 1], ["created_at", "2023-09-04 09:59:01.758479"], ["updated_at", "2023-09-04 09:59:01.758479"]]

  def unfollow
    user = User.find(params[:id])
    current_user.followed_users.find_by(followee_id: user.id).destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "follows" WHERE "follows"."id" = ?  [["id", 12]]

  def show
    follower_ids = @current_user.followers.pluck(:follower_id)
    followee_ids = @current_user.followees.pluck(:followee_id)
    post_user_ids = (follower_ids + followee_ids + [@current_user.id]).uniq
    @posts = Post.where(user_id: post_user_ids)
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" IN (?, ?, ?)  [["user_id", 1], ["user_id", 2], ["user_id", 3]]

  def destroy
    @current_user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]

  def signup
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("email", "password_digest", "fname", "lname", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["email", "ap@gmail.com"], ["password_digest", "[FILTERED]"], ["fname", "Akshat"], ["lname", "Pegwar"], ["created_at", "2023-09-03 21:02:54.726619"], ["updated_at", "2023-09-03 21:02:54.726619"]]