app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 2]]
---
  def user_post
    @user=User.find(params[:id])
    follower_ids = @user.followers.pluck(:follower_id)
    followee_ids = @user.followees.pluck(:followee_id)
    post_user_ids = (follower_ids + followee_ids + [@user.id]).uniq
    @posts = Post.where(user_id: post_user_ids)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def destroy
    @user = User.find(params[:id])